<?php

namespace Common\Model;

class StatisticsipModel extends BaseModel
{
    public  function getProvince($index = false)
    {
        $hash = [
            1  => '北京',
            2  => '天津',
            3  => '上海',
            4  => '重庆',
            5  => '河北',
            6  => '山西',
            7  => '台湾',
            8  => '辽宁',
            9  => '吉林',
            10 => '黑龙江',
            11 => '江苏',
            12 => '浙江',
            13 => '安徽',
            14 => '福建',
            15 => '江西',
            16 => '山东',
            17 => '河南',
            18 => '湖北',
            19 => '湖南',
            20 => '广东',
            21 => '甘肃',
            22 => '四川',
            23 => '贵州',
            24 => '海南',
            25 => '云南',
            26 => '青海',
            27 => '陕西',
            28 => '广西',
            29 => '西藏',
            30 => '宁夏',
            31 => '新疆',
            32 => '内蒙古',
            33 => '澳门',
            34 => '香港',
            35 => '其他'
        ];
        return $index === false?$hash:$hash[$index];
    }

}
