<?php
return array (
  '10_10' => 
  array (
    'id' => 10,
    'pid' => 10,
    'name' => '七台河市',
  ),
  '10_11' => 
  array (
    'id' => 10,
    'pid' => 11,
    'name' => '扬州市',
  ),
  '10_12' => 
  array (
    'id' => 10,
    'pid' => 12,
    'name' => '台州市',
  ),
  '10_13' => 
  array (
    'id' => 10,
    'pid' => 13,
    'name' => '滁州市',
  ),
  '10_15' => 
  array (
    'id' => 10,
    'pid' => 15,
    'name' => '抚州市',
  ),
  '10_16' => 
  array (
    'id' => 10,
    'pid' => 16,
    'name' => '威海市',
  ),
  '10_17' => 
  array (
    'id' => 10,
    'pid' => 17,
    'name' => '许昌市',
  ),
  '10_18' => 
  array (
    'id' => 10,
    'pid' => 18,
    'name' => '黄冈市',
  ),
  '10_19' => 
  array (
    'id' => 10,
    'pid' => 19,
    'name' => '郴州市',
  ),
  '10_20' => 
  array (
    'id' => 10,
    'pid' => 20,
    'name' => '肇庆市',
  ),
  '10_21' => 
  array (
    'id' => 10,
    'pid' => 21,
    'name' => '庆阳市',
  ),
  '10_22' => 
  array (
    'id' => 10,
    'pid' => 22,
    'name' => '乐山市',
  ),
  '10_24' => 
  array (
    'id' => 10,
    'pid' => 24,
    'name' => '定安县',
  ),
  '10_25' => 
  array (
    'id' => 10,
    'pid' => 25,
    'name' => '红河哈尼族彝族自治州',
  ),
  '10_27' => 
  array (
    'id' => 10,
    'pid' => 27,
    'name' => '商洛市',
  ),
  '10_28' => 
  array (
    'id' => 10,
    'pid' => 28,
    'name' => '百色市',
  ),
  '10_31' => 
  array (
    'id' => 10,
    'pid' => 31,
    'name' => '哈密市',
  ),
  '10_32' => 
  array (
    'id' => 10,
    'pid' => 32,
    'name' => '锡林郭勒盟',
  ),
  '10_5' => 
  array (
    'id' => 10,
    'pid' => 5,
    'name' => '廊坊市',
  ),
  '10_6' => 
  array (
    'id' => 10,
    'pid' => 6,
    'name' => '临汾市',
  ),
  '10_7' => 
  array (
    'id' => 10,
    'pid' => 7,
    'name' => '桃园县',
  ),
  '10_8' => 
  array (
    'id' => 10,
    'pid' => 8,
    'name' => '辽阳市',
  ),
  '11_10' => 
  array (
    'id' => 11,
    'pid' => 10,
    'name' => '黑河市',
  ),
  '11_11' => 
  array (
    'id' => 11,
    'pid' => 11,
    'name' => '镇江市',
  ),
  '11_12' => 
  array (
    'id' => 11,
    'pid' => 12,
    'name' => '丽水市',
  ),
  '11_13' => 
  array (
    'id' => 11,
    'pid' => 13,
    'name' => '阜阳市',
  ),
  '11_15' => 
  array (
    'id' => 11,
    'pid' => 15,
    'name' => '上饶市',
  ),
  '11_16' => 
  array (
    'id' => 11,
    'pid' => 16,
    'name' => '日照市',
  ),
  '11_17' => 
  array (
    'id' => 11,
    'pid' => 17,
    'name' => '漯河市',
  ),
  '11_18' => 
  array (
    'id' => 11,
    'pid' => 18,
    'name' => '咸宁市',
  ),
  '11_19' => 
  array (
    'id' => 11,
    'pid' => 19,
    'name' => '永州市',
  ),
  '11_20' => 
  array (
    'id' => 11,
    'pid' => 20,
    'name' => '惠州市',
  ),
  '11_21' => 
  array (
    'id' => 11,
    'pid' => 21,
    'name' => '定西市',
  ),
  '11_22' => 
  array (
    'id' => 11,
    'pid' => 22,
    'name' => '南充市',
  ),
  '11_24' => 
  array (
    'id' => 11,
    'pid' => 24,
    'name' => '屯昌县',
  ),
  '11_25' => 
  array (
    'id' => 11,
    'pid' => 25,
    'name' => '西双版纳傣族自治州',
  ),
  '11_28' => 
  array (
    'id' => 11,
    'pid' => 28,
    'name' => '贺州市',
  ),
  '11_31' => 
  array (
    'id' => 11,
    'pid' => 31,
    'name' => '和田市',
  ),
  '11_32' => 
  array (
    'id' => 11,
    'pid' => 32,
    'name' => '兴安盟',
  ),
  '11_5' => 
  array (
    'id' => 11,
    'pid' => 5,
    'name' => '衡水市',
  ),
  '11_6' => 
  array (
    'id' => 11,
    'pid' => 6,
    'name' => '吕梁市',
  ),
  '11_7' => 
  array (
    'id' => 11,
    'pid' => 7,
    'name' => '新竹县',
  ),
  '11_8' => 
  array (
    'id' => 11,
    'pid' => 8,
    'name' => '盘锦市',
  ),
  '12_10' => 
  array (
    'id' => 12,
    'pid' => 10,
    'name' => '绥化市',
  ),
  '12_11' => 
  array (
    'id' => 12,
    'pid' => 11,
    'name' => '泰州市',
  ),
  '12_13' => 
  array (
    'id' => 12,
    'pid' => 13,
    'name' => '宿州市',
  ),
  '12_16' => 
  array (
    'id' => 12,
    'pid' => 16,
    'name' => '莱芜市',
  ),
  '12_17' => 
  array (
    'id' => 12,
    'pid' => 17,
    'name' => '三门峡市',
  ),
  '12_18' => 
  array (
    'id' => 12,
    'pid' => 18,
    'name' => '随州市',
  ),
  '12_19' => 
  array (
    'id' => 12,
    'pid' => 19,
    'name' => '怀化市',
  ),
  '12_20' => 
  array (
    'id' => 12,
    'pid' => 20,
    'name' => '梅州市',
  ),
  '12_21' => 
  array (
    'id' => 12,
    'pid' => 21,
    'name' => '陇南市',
  ),
  '12_22' => 
  array (
    'id' => 12,
    'pid' => 22,
    'name' => '眉山市',
  ),
  '12_24' => 
  array (
    'id' => 12,
    'pid' => 24,
    'name' => '临高县',
  ),
  '12_25' => 
  array (
    'id' => 12,
    'pid' => 25,
    'name' => '楚雄彝族自治州',
  ),
  '12_28' => 
  array (
    'id' => 12,
    'pid' => 28,
    'name' => '河池市',
  ),
  '12_31' => 
  array (
    'id' => 12,
    'pid' => 31,
    'name' => '阿图什市',
  ),
  '12_32' => 
  array (
    'id' => 12,
    'pid' => 32,
    'name' => '阿拉善盟',
  ),
  '12_7' => 
  array (
    'id' => 12,
    'pid' => 7,
    'name' => '苗栗县',
  ),
  '12_8' => 
  array (
    'id' => 12,
    'pid' => 8,
    'name' => '铁岭市',
  ),
  '13_10' => 
  array (
    'id' => 13,
    'pid' => 10,
    'name' => '大兴安岭地区',
  ),
  '13_11' => 
  array (
    'id' => 13,
    'pid' => 11,
    'name' => '宿迁市',
  ),
  '13_13' => 
  array (
    'id' => 13,
    'pid' => 13,
    'name' => '巢湖市',
  ),
  '13_16' => 
  array (
    'id' => 13,
    'pid' => 16,
    'name' => '临沂市',
  ),
  '13_17' => 
  array (
    'id' => 13,
    'pid' => 17,
    'name' => '南阳市',
  ),
  '13_18' => 
  array (
    'id' => 13,
    'pid' => 18,
    'name' => '仙桃市',
  ),
  '13_19' => 
  array (
    'id' => 13,
    'pid' => 19,
    'name' => '娄底市',
  ),
  '13_20' => 
  array (
    'id' => 13,
    'pid' => 20,
    'name' => '汕尾市',
  ),
  '13_21' => 
  array (
    'id' => 13,
    'pid' => 21,
    'name' => '临夏回族自治州',
  ),
  '13_22' => 
  array (
    'id' => 13,
    'pid' => 22,
    'name' => '宜宾市',
  ),
  '13_24' => 
  array (
    'id' => 13,
    'pid' => 24,
    'name' => '白沙黎族自治县',
  ),
  '13_25' => 
  array (
    'id' => 13,
    'pid' => 25,
    'name' => '大理白族自治州',
  ),
  '13_28' => 
  array (
    'id' => 13,
    'pid' => 28,
    'name' => '>来宾市',
  ),
  '13_31' => 
  array (
    'id' => 13,
    'pid' => 31,
    'name' => '库尔勒市',
  ),
  '13_7' => 
  array (
    'id' => 13,
    'pid' => 7,
    'name' => '台中县',
  ),
  '13_8' => 
  array (
    'id' => 13,
    'pid' => 8,
    'name' => '朝阳市',
  ),
  '14_13' => 
  array (
    'id' => 14,
    'pid' => 13,
    'name' => '六安市',
  ),
  '14_16' => 
  array (
    'id' => 14,
    'pid' => 16,
    'name' => '德州市',
  ),
  '14_17' => 
  array (
    'id' => 14,
    'pid' => 17,
    'name' => '商丘市',
  ),
  '14_18' => 
  array (
    'id' => 14,
    'pid' => 18,
    'name' => '天门市',
  ),
  '14_19' => 
  array (
    'id' => 14,
    'pid' => 19,
    'name' => '湘西土家族苗族自治州',
  ),
  '14_20' => 
  array (
    'id' => 14,
    'pid' => 20,
    'name' => '河源市',
  ),
  '14_21' => 
  array (
    'id' => 14,
    'pid' => 21,
    'name' => '甘南藏族自治州',
  ),
  '14_22' => 
  array (
    'id' => 14,
    'pid' => 22,
    'name' => '广安市',
  ),
  '14_24' => 
  array (
    'id' => 14,
    'pid' => 24,
    'name' => '昌江黎族自治县',
  ),
  '14_25' => 
  array (
    'id' => 14,
    'pid' => 25,
    'name' => '德宏傣族景颇族自治州',
  ),
  '14_28' => 
  array (
    'id' => 14,
    'pid' => 28,
    'name' => '崇左市',
  ),
  '14_31' => 
  array (
    'id' => 14,
    'pid' => 31,
    'name' => '昌吉市　',
  ),
  '14_7' => 
  array (
    'id' => 14,
    'pid' => 7,
    'name' => '彰化县',
  ),
  '14_8' => 
  array (
    'id' => 14,
    'pid' => 8,
    'name' => '葫芦岛市',
  ),
  '15_13' => 
  array (
    'id' => 15,
    'pid' => 13,
    'name' => '亳州市',
  ),
  '15_16' => 
  array (
    'id' => 15,
    'pid' => 16,
    'name' => '聊城市',
  ),
  '15_17' => 
  array (
    'id' => 15,
    'pid' => 17,
    'name' => '信阳市',
  ),
  '15_18' => 
  array (
    'id' => 15,
    'pid' => 18,
    'name' => '潜江市',
  ),
  '15_20' => 
  array (
    'id' => 15,
    'pid' => 20,
    'name' => '阳江市',
  ),
  '15_22' => 
  array (
    'id' => 15,
    'pid' => 22,
    'name' => '达州市',
  ),
  '15_24' => 
  array (
    'id' => 15,
    'pid' => 24,
    'name' => '乐东黎族自治县',
  ),
  '15_25' => 
  array (
    'id' => 15,
    'pid' => 25,
    'name' => '怒江傈傈族自治州',
  ),
  '15_31' => 
  array (
    'id' => 15,
    'pid' => 31,
    'name' => '阜康市',
  ),
  '15_7' => 
  array (
    'id' => 15,
    'pid' => 7,
    'name' => '南投县',
  ),
  '16_13' => 
  array (
    'id' => 16,
    'pid' => 13,
    'name' => '池州市',
  ),
  '16_16' => 
  array (
    'id' => 16,
    'pid' => 16,
    'name' => '滨州市',
  ),
  '16_17' => 
  array (
    'id' => 16,
    'pid' => 17,
    'name' => '周口市',
  ),
  '16_18' => 
  array (
    'id' => 16,
    'pid' => 18,
    'name' => '神农架林区',
  ),
  '16_20' => 
  array (
    'id' => 16,
    'pid' => 20,
    'name' => '清远市',
  ),
  '16_22' => 
  array (
    'id' => 16,
    'pid' => 22,
    'name' => '雅安市',
  ),
  '16_24' => 
  array (
    'id' => 16,
    'pid' => 24,
    'name' => '陵水黎族自治县',
  ),
  '16_25' => 
  array (
    'id' => 16,
    'pid' => 25,
    'name' => '迪庆藏族自治州',
  ),
  '16_31' => 
  array (
    'id' => 16,
    'pid' => 31,
    'name' => '米泉市',
  ),
  '16_7' => 
  array (
    'id' => 16,
    'pid' => 7,
    'name' => '云林县',
  ),
  '17_13' => 
  array (
    'id' => 17,
    'pid' => 13,
    'name' => '宣城市',
  ),
  '17_16' => 
  array (
    'id' => 17,
    'pid' => 16,
    'name' => '菏泽市',
  ),
  '17_17' => 
  array (
    'id' => 17,
    'pid' => 17,
    'name' => '驻马店市',
  ),
  '17_18' => 
  array (
    'id' => 17,
    'pid' => 18,
    'name' => '恩施土家族苗族自治州',
  ),
  '17_20' => 
  array (
    'id' => 17,
    'pid' => 20,
    'name' => '东莞市',
  ),
  '17_22' => 
  array (
    'id' => 17,
    'pid' => 22,
    'name' => '巴中市',
  ),
  '17_24' => 
  array (
    'id' => 17,
    'pid' => 24,
    'name' => '保亭黎族苗族自治县',
  ),
  '17_31' => 
  array (
    'id' => 17,
    'pid' => 31,
    'name' => '博乐市',
  ),
  '17_7' => 
  array (
    'id' => 17,
    'pid' => 7,
    'name' => '嘉义县',
  ),
  '18_17' => 
  array (
    'id' => 18,
    'pid' => 17,
    'name' => '济源市',
  ),
  '18_20' => 
  array (
    'id' => 18,
    'pid' => 20,
    'name' => '中山市',
  ),
  '18_22' => 
  array (
    'id' => 18,
    'pid' => 22,
    'name' => '资阳市',
  ),
  '18_24' => 
  array (
    'id' => 18,
    'pid' => 24,
    'name' => '琼中黎族苗族自治县',
  ),
  '18_31' => 
  array (
    'id' => 18,
    'pid' => 31,
    'name' => '伊宁市',
  ),
  '18_7' => 
  array (
    'id' => 18,
    'pid' => 7,
    'name' => '台南县',
  ),
  '19_20' => 
  array (
    'id' => 19,
    'pid' => 20,
    'name' => '潮州市',
  ),
  '19_22' => 
  array (
    'id' => 19,
    'pid' => 22,
    'name' => '阿坝藏族羌族自治州',
  ),
  '19_31' => 
  array (
    'id' => 19,
    'pid' => 31,
    'name' => '奎屯市',
  ),
  '19_7' => 
  array (
    'id' => 19,
    'pid' => 7,
    'name' => '高雄县',
  ),
  '1_1' => 
  array (
    'id' => 1,
    'pid' => 1,
    'name' => '北京市',
  ),
  '1_10' => 
  array (
    'id' => 1,
    'pid' => 10,
    'name' => '哈尔滨市',
  ),
  '1_11' => 
  array (
    'id' => 1,
    'pid' => 11,
    'name' => '南京市',
  ),
  '1_12' => 
  array (
    'id' => 1,
    'pid' => 12,
    'name' => '杭州市',
  ),
  '1_13' => 
  array (
    'id' => 1,
    'pid' => 13,
    'name' => '合肥市',
  ),
  '1_14' => 
  array (
    'id' => 1,
    'pid' => 14,
    'name' => '福州市',
  ),
  '1_15' => 
  array (
    'id' => 1,
    'pid' => 15,
    'name' => '南昌市',
  ),
  '1_16' => 
  array (
    'id' => 1,
    'pid' => 16,
    'name' => '济南市',
  ),
  '1_17' => 
  array (
    'id' => 1,
    'pid' => 17,
    'name' => '郑州市',
  ),
  '1_18' => 
  array (
    'id' => 1,
    'pid' => 18,
    'name' => '武汉市',
  ),
  '1_19' => 
  array (
    'id' => 1,
    'pid' => 19,
    'name' => '长沙市',
  ),
  '1_2' => 
  array (
    'id' => 1,
    'pid' => 2,
    'name' => '天津市',
  ),
  '1_20' => 
  array (
    'id' => 1,
    'pid' => 20,
    'name' => '广州市',
  ),
  '1_21' => 
  array (
    'id' => 1,
    'pid' => 21,
    'name' => '兰州市',
  ),
  '1_22' => 
  array (
    'id' => 1,
    'pid' => 22,
    'name' => '成都市',
  ),
  '1_23' => 
  array (
    'id' => 1,
    'pid' => 23,
    'name' => '贵阳市',
  ),
  '1_24' => 
  array (
    'id' => 1,
    'pid' => 24,
    'name' => '海口市',
  ),
  '1_25' => 
  array (
    'id' => 1,
    'pid' => 25,
    'name' => '昆明市',
  ),
  '1_26' => 
  array (
    'id' => 1,
    'pid' => 26,
    'name' => '西宁市',
  ),
  '1_27' => 
  array (
    'id' => 1,
    'pid' => 27,
    'name' => '西安市',
  ),
  '1_28' => 
  array (
    'id' => 1,
    'pid' => 28,
    'name' => '南宁市',
  ),
  '1_29' => 
  array (
    'id' => 1,
    'pid' => 29,
    'name' => '拉萨市',
  ),
  '1_3' => 
  array (
    'id' => 1,
    'pid' => 3,
    'name' => '上海市',
  ),
  '1_30' => 
  array (
    'id' => 1,
    'pid' => 30,
    'name' => '银川市',
  ),
  '1_31' => 
  array (
    'id' => 1,
    'pid' => 31,
    'name' => '乌鲁木齐市',
  ),
  '1_32' => 
  array (
    'id' => 1,
    'pid' => 32,
    'name' => '呼和浩特市',
  ),
  '1_33' => 
  array (
    'id' => 1,
    'pid' => 33,
    'name' => '澳门特别行政区',
  ),
  '1_34' => 
  array (
    'id' => 1,
    'pid' => 34,
    'name' => '香港特别行政区',
  ),
  '1_4' => 
  array (
    'id' => 1,
    'pid' => 4,
    'name' => '重庆市',
  ),
  '1_5' => 
  array (
    'id' => 1,
    'pid' => 5,
    'name' => '石家庄市',
  ),
  '1_6' => 
  array (
    'id' => 1,
    'pid' => 6,
    'name' => '太原市',
  ),
  '1_7' => 
  array (
    'id' => 1,
    'pid' => 7,
    'name' => '台北市',
  ),
  '1_8' => 
  array (
    'id' => 1,
    'pid' => 8,
    'name' => '沈阳市',
  ),
  '1_9' => 
  array (
    'id' => 1,
    'pid' => 9,
    'name' => '长春市',
  ),
  '20_20' => 
  array (
    'id' => 20,
    'pid' => 20,
    'name' => '揭阳市',
  ),
  '20_22' => 
  array (
    'id' => 20,
    'pid' => 22,
    'name' => '甘孜藏族自治州',
  ),
  '20_31' => 
  array (
    'id' => 20,
    'pid' => 31,
    'name' => '塔城市',
  ),
  '20_7' => 
  array (
    'id' => 20,
    'pid' => 7,
    'name' => '屏东县',
  ),
  '21_20' => 
  array (
    'id' => 21,
    'pid' => 20,
    'name' => '云浮市',
  ),
  '21_22' => 
  array (
    'id' => 21,
    'pid' => 22,
    'name' => '凉山彝族自治州',
  ),
  '21_31' => 
  array (
    'id' => 21,
    'pid' => 31,
    'name' => '乌苏市',
  ),
  '21_7' => 
  array (
    'id' => 21,
    'pid' => 7,
    'name' => '澎湖县',
  ),
  '22_31' => 
  array (
    'id' => 22,
    'pid' => 31,
    'name' => '阿勒泰市',
  ),
  '22_7' => 
  array (
    'id' => 22,
    'pid' => 7,
    'name' => '台东县',
  ),
  '23_7' => 
  array (
    'id' => 23,
    'pid' => 7,
    'name' => '花莲县',
  ),
  '2_10' => 
  array (
    'id' => 2,
    'pid' => 10,
    'name' => '齐齐哈尔市',
  ),
  '2_11' => 
  array (
    'id' => 2,
    'pid' => 11,
    'name' => '无锡市',
  ),
  '2_12' => 
  array (
    'id' => 2,
    'pid' => 12,
    'name' => '宁波市',
  ),
  '2_13' => 
  array (
    'id' => 2,
    'pid' => 13,
    'name' => '芜湖市',
  ),
  '2_14' => 
  array (
    'id' => 2,
    'pid' => 14,
    'name' => '厦门市',
  ),
  '2_15' => 
  array (
    'id' => 2,
    'pid' => 15,
    'name' => '景德镇市',
  ),
  '2_16' => 
  array (
    'id' => 2,
    'pid' => 16,
    'name' => '青岛市',
  ),
  '2_17' => 
  array (
    'id' => 2,
    'pid' => 17,
    'name' => '开封市',
  ),
  '2_18' => 
  array (
    'id' => 2,
    'pid' => 18,
    'name' => '黄石市',
  ),
  '2_19' => 
  array (
    'id' => 2,
    'pid' => 19,
    'name' => '株洲市',
  ),
  '2_20' => 
  array (
    'id' => 2,
    'pid' => 20,
    'name' => '深圳市',
  ),
  '2_21' => 
  array (
    'id' => 2,
    'pid' => 21,
    'name' => '金昌市',
  ),
  '2_22' => 
  array (
    'id' => 2,
    'pid' => 22,
    'name' => '自贡市',
  ),
  '2_23' => 
  array (
    'id' => 2,
    'pid' => 23,
    'name' => '六盘水市',
  ),
  '2_24' => 
  array (
    'id' => 2,
    'pid' => 24,
    'name' => '三亚市',
  ),
  '2_25' => 
  array (
    'id' => 2,
    'pid' => 25,
    'name' => '曲靖市',
  ),
  '2_26' => 
  array (
    'id' => 2,
    'pid' => 26,
    'name' => '海东地区',
  ),
  '2_27' => 
  array (
    'id' => 2,
    'pid' => 27,
    'name' => '铜川市',
  ),
  '2_28' => 
  array (
    'id' => 2,
    'pid' => 28,
    'name' => '柳州市',
  ),
  '2_29' => 
  array (
    'id' => 2,
    'pid' => 29,
    'name' => '那曲地区',
  ),
  '2_30' => 
  array (
    'id' => 2,
    'pid' => 30,
    'name' => '石嘴山市',
  ),
  '2_31' => 
  array (
    'id' => 2,
    'pid' => 31,
    'name' => '克拉玛依市',
  ),
  '2_32' => 
  array (
    'id' => 2,
    'pid' => 32,
    'name' => '包头市',
  ),
  '2_5' => 
  array (
    'id' => 2,
    'pid' => 5,
    'name' => '唐山市',
  ),
  '2_6' => 
  array (
    'id' => 2,
    'pid' => 6,
    'name' => '大同市',
  ),
  '2_7' => 
  array (
    'id' => 2,
    'pid' => 7,
    'name' => '高雄市',
  ),
  '2_8' => 
  array (
    'id' => 2,
    'pid' => 8,
    'name' => '大连市',
  ),
  '2_9' => 
  array (
    'id' => 2,
    'pid' => 9,
    'name' => '吉林市',
  ),
  '3_10' => 
  array (
    'id' => 3,
    'pid' => 10,
    'name' => '鹤岗市',
  ),
  '3_11' => 
  array (
    'id' => 3,
    'pid' => 11,
    'name' => '徐州市',
  ),
  '3_12' => 
  array (
    'id' => 3,
    'pid' => 12,
    'name' => '温州市',
  ),
  '3_13' => 
  array (
    'id' => 3,
    'pid' => 13,
    'name' => '蚌埠市',
  ),
  '3_14' => 
  array (
    'id' => 3,
    'pid' => 14,
    'name' => '莆田市',
  ),
  '3_15' => 
  array (
    'id' => 3,
    'pid' => 15,
    'name' => '萍乡市',
  ),
  '3_16' => 
  array (
    'id' => 3,
    'pid' => 16,
    'name' => '淄博市',
  ),
  '3_17' => 
  array (
    'id' => 3,
    'pid' => 17,
    'name' => '洛阳市',
  ),
  '3_18' => 
  array (
    'id' => 3,
    'pid' => 18,
    'name' => '十堰市',
  ),
  '3_19' => 
  array (
    'id' => 3,
    'pid' => 19,
    'name' => '湘潭市',
  ),
  '3_20' => 
  array (
    'id' => 3,
    'pid' => 20,
    'name' => '珠海市',
  ),
  '3_21' => 
  array (
    'id' => 3,
    'pid' => 21,
    'name' => '白银市',
  ),
  '3_22' => 
  array (
    'id' => 3,
    'pid' => 22,
    'name' => '攀枝花市',
  ),
  '3_23' => 
  array (
    'id' => 3,
    'pid' => 23,
    'name' => '遵义市',
  ),
  '3_24' => 
  array (
    'id' => 3,
    'pid' => 24,
    'name' => '五指山市',
  ),
  '3_25' => 
  array (
    'id' => 3,
    'pid' => 25,
    'name' => '玉溪市',
  ),
  '3_26' => 
  array (
    'id' => 3,
    'pid' => 26,
    'name' => '海北藏族自治州',
  ),
  '3_27' => 
  array (
    'id' => 3,
    'pid' => 27,
    'name' => '宝鸡市',
  ),
  '3_28' => 
  array (
    'id' => 3,
    'pid' => 28,
    'name' => '桂林市',
  ),
  '3_29' => 
  array (
    'id' => 3,
    'pid' => 29,
    'name' => '昌都地区',
  ),
  '3_30' => 
  array (
    'id' => 3,
    'pid' => 30,
    'name' => '吴忠市',
  ),
  '3_31' => 
  array (
    'id' => 3,
    'pid' => 31,
    'name' => '石河子市　',
  ),
  '3_32' => 
  array (
    'id' => 3,
    'pid' => 32,
    'name' => '乌海市',
  ),
  '3_5' => 
  array (
    'id' => 3,
    'pid' => 5,
    'name' => '秦皇岛市',
  ),
  '3_6' => 
  array (
    'id' => 3,
    'pid' => 6,
    'name' => '阳泉市',
  ),
  '3_7' => 
  array (
    'id' => 3,
    'pid' => 7,
    'name' => '基隆市',
  ),
  '3_8' => 
  array (
    'id' => 3,
    'pid' => 8,
    'name' => '鞍山市',
  ),
  '3_9' => 
  array (
    'id' => 3,
    'pid' => 9,
    'name' => '四平市',
  ),
  '4_10' => 
  array (
    'id' => 4,
    'pid' => 10,
    'name' => '双鸭山市',
  ),
  '4_11' => 
  array (
    'id' => 4,
    'pid' => 11,
    'name' => '常州市',
  ),
  '4_12' => 
  array (
    'id' => 4,
    'pid' => 12,
    'name' => '嘉兴市',
  ),
  '4_13' => 
  array (
    'id' => 4,
    'pid' => 13,
    'name' => '淮南市',
  ),
  '4_14' => 
  array (
    'id' => 4,
    'pid' => 14,
    'name' => '三明市',
  ),
  '4_15' => 
  array (
    'id' => 4,
    'pid' => 15,
    'name' => '九江市',
  ),
  '4_16' => 
  array (
    'id' => 4,
    'pid' => 16,
    'name' => '枣庄市',
  ),
  '4_17' => 
  array (
    'id' => 4,
    'pid' => 17,
    'name' => '平顶山市',
  ),
  '4_18' => 
  array (
    'id' => 4,
    'pid' => 18,
    'name' => '荆州市',
  ),
  '4_19' => 
  array (
    'id' => 4,
    'pid' => 19,
    'name' => '衡阳市',
  ),
  '4_20' => 
  array (
    'id' => 4,
    'pid' => 20,
    'name' => '汕头市',
  ),
  '4_21' => 
  array (
    'id' => 4,
    'pid' => 21,
    'name' => '天水市',
  ),
  '4_22' => 
  array (
    'id' => 4,
    'pid' => 22,
    'name' => '泸州市',
  ),
  '4_23' => 
  array (
    'id' => 4,
    'pid' => 23,
    'name' => '安顺市',
  ),
  '4_24' => 
  array (
    'id' => 4,
    'pid' => 24,
    'name' => '琼海市',
  ),
  '4_25' => 
  array (
    'id' => 4,
    'pid' => 25,
    'name' => '保山市',
  ),
  '4_26' => 
  array (
    'id' => 4,
    'pid' => 26,
    'name' => '黄南藏族自治州',
  ),
  '4_27' => 
  array (
    'id' => 4,
    'pid' => 27,
    'name' => '咸阳市',
  ),
  '4_28' => 
  array (
    'id' => 4,
    'pid' => 28,
    'name' => '梧州市',
  ),
  '4_29' => 
  array (
    'id' => 4,
    'pid' => 29,
    'name' => '山南地区',
  ),
  '4_30' => 
  array (
    'id' => 4,
    'pid' => 30,
    'name' => '固原市',
  ),
  '4_31' => 
  array (
    'id' => 4,
    'pid' => 31,
    'name' => '阿拉尔市',
  ),
  '4_32' => 
  array (
    'id' => 4,
    'pid' => 32,
    'name' => '赤峰市',
  ),
  '4_5' => 
  array (
    'id' => 4,
    'pid' => 5,
    'name' => '邯郸市',
  ),
  '4_6' => 
  array (
    'id' => 4,
    'pid' => 6,
    'name' => '长治市',
  ),
  '4_7' => 
  array (
    'id' => 4,
    'pid' => 7,
    'name' => '台中市',
  ),
  '4_8' => 
  array (
    'id' => 4,
    'pid' => 8,
    'name' => '抚顺市',
  ),
  '4_9' => 
  array (
    'id' => 4,
    'pid' => 9,
    'name' => '辽源市',
  ),
  '5_10' => 
  array (
    'id' => 5,
    'pid' => 10,
    'name' => '鸡西市',
  ),
  '5_11' => 
  array (
    'id' => 5,
    'pid' => 11,
    'name' => '苏州市',
  ),
  '5_12' => 
  array (
    'id' => 5,
    'pid' => 12,
    'name' => '湖州市',
  ),
  '5_13' => 
  array (
    'id' => 5,
    'pid' => 13,
    'name' => '马鞍山市',
  ),
  '5_14' => 
  array (
    'id' => 5,
    'pid' => 14,
    'name' => '泉州市',
  ),
  '5_15' => 
  array (
    'id' => 5,
    'pid' => 15,
    'name' => '新余市',
  ),
  '5_16' => 
  array (
    'id' => 5,
    'pid' => 16,
    'name' => '东营市',
  ),
  '5_17' => 
  array (
    'id' => 5,
    'pid' => 17,
    'name' => '安阳市',
  ),
  '5_18' => 
  array (
    'id' => 5,
    'pid' => 18,
    'name' => '宜昌市',
  ),
  '5_19' => 
  array (
    'id' => 5,
    'pid' => 19,
    'name' => '邵阳市',
  ),
  '5_20' => 
  array (
    'id' => 5,
    'pid' => 20,
    'name' => '韶关市',
  ),
  '5_21' => 
  array (
    'id' => 5,
    'pid' => 21,
    'name' => '嘉峪关市',
  ),
  '5_22' => 
  array (
    'id' => 5,
    'pid' => 22,
    'name' => '德阳市',
  ),
  '5_23' => 
  array (
    'id' => 5,
    'pid' => 23,
    'name' => '铜仁地区',
  ),
  '5_24' => 
  array (
    'id' => 5,
    'pid' => 24,
    'name' => '儋州市',
  ),
  '5_25' => 
  array (
    'id' => 5,
    'pid' => 25,
    'name' => '昭通市',
  ),
  '5_26' => 
  array (
    'id' => 5,
    'pid' => 26,
    'name' => '海南藏族自治州',
  ),
  '5_27' => 
  array (
    'id' => 5,
    'pid' => 27,
    'name' => '渭南市',
  ),
  '5_28' => 
  array (
    'id' => 5,
    'pid' => 28,
    'name' => '北海市',
  ),
  '5_29' => 
  array (
    'id' => 5,
    'pid' => 29,
    'name' => '日喀则地区',
  ),
  '5_30' => 
  array (
    'id' => 5,
    'pid' => 30,
    'name' => '中卫市',
  ),
  '5_31' => 
  array (
    'id' => 5,
    'pid' => 31,
    'name' => '图木舒克市',
  ),
  '5_32' => 
  array (
    'id' => 5,
    'pid' => 32,
    'name' => '通辽市',
  ),
  '5_5' => 
  array (
    'id' => 5,
    'pid' => 5,
    'name' => '邢台市',
  ),
  '5_6' => 
  array (
    'id' => 5,
    'pid' => 6,
    'name' => '晋城市',
  ),
  '5_7' => 
  array (
    'id' => 5,
    'pid' => 7,
    'name' => '台南市',
  ),
  '5_8' => 
  array (
    'id' => 5,
    'pid' => 8,
    'name' => '本溪市',
  ),
  '5_9' => 
  array (
    'id' => 5,
    'pid' => 9,
    'name' => '通化市',
  ),
  '6_10' => 
  array (
    'id' => 6,
    'pid' => 10,
    'name' => '大庆市',
  ),
  '6_11' => 
  array (
    'id' => 6,
    'pid' => 11,
    'name' => '南通市',
  ),
  '6_12' => 
  array (
    'id' => 6,
    'pid' => 12,
    'name' => '绍兴市',
  ),
  '6_13' => 
  array (
    'id' => 6,
    'pid' => 13,
    'name' => '淮北市',
  ),
  '6_14' => 
  array (
    'id' => 6,
    'pid' => 14,
    'name' => '漳>州市',
  ),
  '6_15' => 
  array (
    'id' => 6,
    'pid' => 15,
    'name' => '鹰潭市',
  ),
  '6_16' => 
  array (
    'id' => 6,
    'pid' => 16,
    'name' => '烟台市',
  ),
  '6_17' => 
  array (
    'id' => 6,
    'pid' => 17,
    'name' => '鹤壁市',
  ),
  '6_18' => 
  array (
    'id' => 6,
    'pid' => 18,
    'name' => '襄樊市',
  ),
  '6_19' => 
  array (
    'id' => 6,
    'pid' => 19,
    'name' => '岳阳市',
  ),
  '6_20' => 
  array (
    'id' => 6,
    'pid' => 20,
    'name' => '佛山市',
  ),
  '6_21' => 
  array (
    'id' => 6,
    'pid' => 21,
    'name' => '武威市',
  ),
  '6_22' => 
  array (
    'id' => 6,
    'pid' => 22,
    'name' => '绵阳市',
  ),
  '6_23' => 
  array (
    'id' => 6,
    'pid' => 23,
    'name' => '毕节地区',
  ),
  '6_24' => 
  array (
    'id' => 6,
    'pid' => 24,
    'name' => '文昌市',
  ),
  '6_25' => 
  array (
    'id' => 6,
    'pid' => 25,
    'name' => '丽江市',
  ),
  '6_26' => 
  array (
    'id' => 6,
    'pid' => 26,
    'name' => '果洛藏族自治州',
  ),
  '6_27' => 
  array (
    'id' => 6,
    'pid' => 27,
    'name' => '延安市',
  ),
  '6_28' => 
  array (
    'id' => 6,
    'pid' => 28,
    'name' => '防城港市',
  ),
  '6_29' => 
  array (
    'id' => 6,
    'pid' => 29,
    'name' => '阿里地区',
  ),
  '6_31' => 
  array (
    'id' => 6,
    'pid' => 31,
    'name' => '五家渠市',
  ),
  '6_32' => 
  array (
    'id' => 6,
    'pid' => 32,
    'name' => '鄂尔多斯市',
  ),
  '6_5' => 
  array (
    'id' => 6,
    'pid' => 5,
    'name' => '保定市',
  ),
  '6_6' => 
  array (
    'id' => 6,
    'pid' => 6,
    'name' => '朔州市',
  ),
  '6_7' => 
  array (
    'id' => 6,
    'pid' => 7,
    'name' => '新竹市',
  ),
  '6_8' => 
  array (
    'id' => 6,
    'pid' => 8,
    'name' => '丹东市',
  ),
  '6_9' => 
  array (
    'id' => 6,
    'pid' => 9,
    'name' => '白山市',
  ),
  '7_10' => 
  array (
    'id' => 7,
    'pid' => 10,
    'name' => '伊春市',
  ),
  '7_11' => 
  array (
    'id' => 7,
    'pid' => 11,
    'name' => '连云港市',
  ),
  '7_12' => 
  array (
    'id' => 7,
    'pid' => 12,
    'name' => '金华市',
  ),
  '7_13' => 
  array (
    'id' => 7,
    'pid' => 13,
    'name' => '铜陵市',
  ),
  '7_14' => 
  array (
    'id' => 7,
    'pid' => 14,
    'name' => '南平市',
  ),
  '7_15' => 
  array (
    'id' => 7,
    'pid' => 15,
    'name' => '赣州市',
  ),
  '7_16' => 
  array (
    'id' => 7,
    'pid' => 16,
    'name' => '潍坊市',
  ),
  '7_17' => 
  array (
    'id' => 7,
    'pid' => 17,
    'name' => '新乡市',
  ),
  '7_18' => 
  array (
    'id' => 7,
    'pid' => 18,
    'name' => '鄂州市',
  ),
  '7_19' => 
  array (
    'id' => 7,
    'pid' => 19,
    'name' => '常德市',
  ),
  '7_20' => 
  array (
    'id' => 7,
    'pid' => 20,
    'name' => '江门市',
  ),
  '7_21' => 
  array (
    'id' => 7,
    'pid' => 21,
    'name' => '张掖市',
  ),
  '7_22' => 
  array (
    'id' => 7,
    'pid' => 22,
    'name' => '广元市',
  ),
  '7_23' => 
  array (
    'id' => 7,
    'pid' => 23,
    'name' => '黔西南布依族苗族自治州',
  ),
  '7_24' => 
  array (
    'id' => 7,
    'pid' => 24,
    'name' => '万宁市',
  ),
  '7_25' => 
  array (
    'id' => 7,
    'pid' => 25,
    'name' => '思茅市',
  ),
  '7_26' => 
  array (
    'id' => 7,
    'pid' => 26,
    'name' => '玉树藏族自治州',
  ),
  '7_27' => 
  array (
    'id' => 7,
    'pid' => 27,
    'name' => '汉中市',
  ),
  '7_28' => 
  array (
    'id' => 7,
    'pid' => 28,
    'name' => '钦州市',
  ),
  '7_29' => 
  array (
    'id' => 7,
    'pid' => 29,
    'name' => '林芝地区',
  ),
  '7_31' => 
  array (
    'id' => 7,
    'pid' => 31,
    'name' => '吐鲁番市',
  ),
  '7_32' => 
  array (
    'id' => 7,
    'pid' => 32,
    'name' => '呼伦贝尔市',
  ),
  '7_5' => 
  array (
    'id' => 7,
    'pid' => 5,
    'name' => '张家口市',
  ),
  '7_6' => 
  array (
    'id' => 7,
    'pid' => 6,
    'name' => '晋中市',
  ),
  '7_7' => 
  array (
    'id' => 7,
    'pid' => 7,
    'name' => '嘉义市',
  ),
  '7_8' => 
  array (
    'id' => 7,
    'pid' => 8,
    'name' => '锦州市',
  ),
  '7_9' => 
  array (
    'id' => 7,
    'pid' => 9,
    'name' => '松原市',
  ),
  '8_10' => 
  array (
    'id' => 8,
    'pid' => 10,
    'name' => '牡丹江市',
  ),
  '8_11' => 
  array (
    'id' => 8,
    'pid' => 11,
    'name' => '淮安市',
  ),
  '8_12' => 
  array (
    'id' => 8,
    'pid' => 12,
    'name' => '衢州市',
  ),
  '8_13' => 
  array (
    'id' => 8,
    'pid' => 13,
    'name' => '安庆市',
  ),
  '8_14' => 
  array (
    'id' => 8,
    'pid' => 14,
    'name' => '龙岩市',
  ),
  '8_15' => 
  array (
    'id' => 8,
    'pid' => 15,
    'name' => '吉安市',
  ),
  '8_16' => 
  array (
    'id' => 8,
    'pid' => 16,
    'name' => '济宁市',
  ),
  '8_17' => 
  array (
    'id' => 8,
    'pid' => 17,
    'name' => '焦作市',
  ),
  '8_18' => 
  array (
    'id' => 8,
    'pid' => 18,
    'name' => '荆门市',
  ),
  '8_19' => 
  array (
    'id' => 8,
    'pid' => 19,
    'name' => '张家界市',
  ),
  '8_20' => 
  array (
    'id' => 8,
    'pid' => 20,
    'name' => '湛江市',
  ),
  '8_21' => 
  array (
    'id' => 8,
    'pid' => 21,
    'name' => '平凉市',
  ),
  '8_22' => 
  array (
    'id' => 8,
    'pid' => 22,
    'name' => '遂宁市',
  ),
  '8_23' => 
  array (
    'id' => 8,
    'pid' => 23,
    'name' => '黔东南苗族侗族自治州',
  ),
  '8_24' => 
  array (
    'id' => 8,
    'pid' => 24,
    'name' => '东方市',
  ),
  '8_25' => 
  array (
    'id' => 8,
    'pid' => 25,
    'name' => '临沧市',
  ),
  '8_26' => 
  array (
    'id' => 8,
    'pid' => 26,
    'name' => '海西蒙古族藏族自治州',
  ),
  '8_27' => 
  array (
    'id' => 8,
    'pid' => 27,
    'name' => '榆林市',
  ),
  '8_28' => 
  array (
    'id' => 8,
    'pid' => 28,
    'name' => '贵港市',
  ),
  '8_31' => 
  array (
    'id' => 8,
    'pid' => 31,
    'name' => '阿克苏市',
  ),
  '8_32' => 
  array (
    'id' => 8,
    'pid' => 32,
    'name' => '巴彦淖尔市',
  ),
  '8_5' => 
  array (
    'id' => 8,
    'pid' => 5,
    'name' => '承德市',
  ),
  '8_6' => 
  array (
    'id' => 8,
    'pid' => 6,
    'name' => '运城市',
  ),
  '8_7' => 
  array (
    'id' => 8,
    'pid' => 7,
    'name' => '台北县',
  ),
  '8_8' => 
  array (
    'id' => 8,
    'pid' => 8,
    'name' => '营口市',
  ),
  '8_9' => 
  array (
    'id' => 8,
    'pid' => 9,
    'name' => '白城市',
  ),
  '9_10' => 
  array (
    'id' => 9,
    'pid' => 10,
    'name' => '佳木斯市',
  ),
  '9_11' => 
  array (
    'id' => 9,
    'pid' => 11,
    'name' => '盐城市',
  ),
  '9_12' => 
  array (
    'id' => 9,
    'pid' => 12,
    'name' => '舟山市',
  ),
  '9_13' => 
  array (
    'id' => 9,
    'pid' => 13,
    'name' => '黄山市',
  ),
  '9_14' => 
  array (
    'id' => 9,
    'pid' => 14,
    'name' => '宁德市',
  ),
  '9_15' => 
  array (
    'id' => 9,
    'pid' => 15,
    'name' => '宜春市',
  ),
  '9_16' => 
  array (
    'id' => 9,
    'pid' => 16,
    'name' => '泰安市',
  ),
  '9_17' => 
  array (
    'id' => 9,
    'pid' => 17,
    'name' => '濮阳市',
  ),
  '9_18' => 
  array (
    'id' => 9,
    'pid' => 18,
    'name' => '孝感市',
  ),
  '9_19' => 
  array (
    'id' => 9,
    'pid' => 19,
    'name' => '益阳市',
  ),
  '9_20' => 
  array (
    'id' => 9,
    'pid' => 20,
    'name' => '茂名市',
  ),
  '9_21' => 
  array (
    'id' => 9,
    'pid' => 21,
    'name' => '酒泉市',
  ),
  '9_22' => 
  array (
    'id' => 9,
    'pid' => 22,
    'name' => '内江市',
  ),
  '9_23' => 
  array (
    'id' => 9,
    'pid' => 23,
    'name' => '黔南布依族苗族自治州',
  ),
  '9_24' => 
  array (
    'id' => 9,
    'pid' => 24,
    'name' => '澄迈县',
  ),
  '9_25' => 
  array (
    'id' => 9,
    'pid' => 25,
    'name' => '文山壮族苗族自治州',
  ),
  '9_27' => 
  array (
    'id' => 9,
    'pid' => 27,
    'name' => '安康市',
  ),
  '9_28' => 
  array (
    'id' => 9,
    'pid' => 28,
    'name' => '玉林市',
  ),
  '9_31' => 
  array (
    'id' => 9,
    'pid' => 31,
    'name' => '喀什市',
  ),
  '9_32' => 
  array (
    'id' => 9,
    'pid' => 32,
    'name' => '乌兰察布市',
  ),
  '9_5' => 
  array (
    'id' => 9,
    'pid' => 5,
    'name' => '沧州市',
  ),
  '9_6' => 
  array (
    'id' => 9,
    'pid' => 6,
    'name' => '忻州市',
  ),
  '9_7' => 
  array (
    'id' => 9,
    'pid' => 7,
    'name' => '宜兰县',
  ),
  '9_8' => 
  array (
    'id' => 9,
    'pid' => 8,
    'name' => '阜新市',
  ),
  '9_9' => 
  array (
    'id' => 9,
    'pid' => 9,
    'name' => '延边朝鲜族自治州',
  ),
);