<?php
/**
 * 用户注册协议
 *
 *   */
?>
<!DOCTYPE html>
<html>
<head>
<title>用户服务协议-欢朋直播-精彩手游直播平台！</title>
<meta charset="UTF-8">
<?php $path = realpath(__DIR__);include $path.'/../tpl/commSource.php';?>
	<script type="application/javascript">
		window.pageTitle = document.title;
	</script>
</head>
<body>
<?php include $path.'/../head.php'; ?>
<style>
body{
	background:#eee;
}
.protocol-contain{
	width:980px;
	margin:100px auto 50px auto;
	color:#666;
}
.protocol-body{
	background:#fff;
	padding:50px;
}
.protocol-body .protocol-title{
	border-bottom: 1px solid #f4f4f4;
    font-family: "微软雅黑";
    padding-bottom: 22px;
}
.protocol-body .protocol-title h3{
	text-align: center;
    font-size: 22px;
    color: #444;
    line-height: 30px;
    font-weight: normal;
}
.protocol-body .protocol-content{
	margin-top: 28px;
    font-family: "微软雅黑";
}
.protocol-body .protocol-content p{
	line-height: 1.5em;
    font-size: 13px;
    padding: 0px 0px;
	text-indent:2em;
}
</style>
<div class="protocol-contain">
<div class="protocol-body">
<div class="protocol-title"><h3>用户注册协议</h3></div>
<div class="protocol-content">
<p >
本《用户注册协议》是您（下称"用户"）与北京六间房科技有限公司（下称"六间房"）之间在使用六间房公司经营的（www.huanpeng.com）网站全部服务前、注册欢朋帐号时签署的协议。
</p>
<h5>1、重要须知</h5>
<p>
在签署本协议之前，六间房公司正式提醒用户：
</p>
<p>
<b>1.1、</b>您应认真阅读（如果您为未满18周岁的自然人，请在法定监护人的陪同下阅读本协议。）、充分理解本《用户注册协议》中各条款，包括免除或者限制六间房公司责任的免责条款及对用户的权利限制条款。未成年人行使和履行本协议项下的权利和义务视为已获得了法定监护人的认可。
</p>
<p>
1.2、用户点击接受并继续使用六间房公司服务的行为，视为用户已完全接受本协议。若您拒绝接受本协议，可以选择退出本次注册。
</p>
<p>
1.3、本协议一经签署，具有法律效力，请慎重考虑是否接受本协议。
</p>
<p>
1.4、签署本协议之后，本协议文本可能因国家政策、产品以及履行本协议的环境发生变化而由六间房公司进行修改，六间房公司保留自行决定在任何时候变更、修改、增加或删除本协议内容的权利。修改后的协议将发布在本网站上，您有责任定期查看本使用条款的变更。若您对修改后的协议有异议的，请立即停止登录、使用六间房公司产品及服务，若您在变更信息发布之后继续登录、使用本网站、或继续使用六间房公司产品，视为对修改后的协议予以认可。
</p>
<p>
1.5、若您遵守本使用条款，六间房公司即授予您一项个人、非排他性、不可转让、有限的权利以登录本网站并使用六间房公司提供的服务。
</p>
<h5>
2、关于“欢朋帐号”
</h5>
<p>
2.1、用户在接受本协议之后，有权选择未被其他用户使用过的字母符号组合作为用户的欢朋账号，并自行设置符合安全要求的密码。用户设置的账号、密码是用户用以登录欢朋直播网站，接受六间房公司服务时应当持有的凭证。
</p>
<p>
2.2、用户在首次注册欢朋账号成功后，六间房公司会按系统规则自动分配给用户一个欢朋ID号码，欢朋ID号码与欢朋账号都是用户接受六间房公司服务的身份识别凭证。
</p>
<p>
2.3、欢朋账号还是用户持有、使用相关虚拟财产、道具的身份凭证。用户如需要接受六间房公司提供的增值服务，则欢朋账号同时也是用户支付费用、接受增值服务的凭证。
</p>
<p>
2.4、欢朋账号或欢朋号码仅限于在六间房公司网站上的注册用户本人使用，禁止赠与、借用、租用、转让或售卖。如果六间房公司发现使用者并非账号初始注册人，有权在未经通知的情况下回收该账号而无需向该账号使用人承担法律责任，由此带来的包括并不限于用户通讯中断、用户资料和道具等清空等损失由用户自行承担。
</p>
<p>
2.5、用户保证注册账号时填写的身份信息是真实的，任何非法、不真实、不准确的用户信息所产生的责任由用户承担。用户应不断更新注册资料，符合及时、详尽、真实、准确的要求。所有原始键入的资料将引用用户的账号注册资料。如果因用户的注册信息不真实而引起的问题，以及对问题发生所带来的后果，六间房公司不负任何责任。
</p>
<p>
2.6、用户应当妥善保管自己的账号、密码，用户就其账号及密码项下之一切活动负全部责任，包括用户数据的修改，虚拟道具的损失以及其他所有的损失由用户自行承担。用户如发现他人未经许可使用其账号时立即通知六间房公司。
</p>
<p>
2.7、用户账号丢失或遗忘密码后，可遵照六间房公司的申诉途径及时申诉请求找回账号。用户知晓并同意其账号及密码保管责任在于用户，六间房公司并不承诺账号丢失或遗忘密码后用户一定能通过申诉找回账号。
</p>
<p>
2.8、用户可以凭初始注册资料及个人密码保护资料填写申诉单向六间房公司申请找回账号，六间房公司的密码找回机制仅负责识别申诉单上所填资料与系统记录资料的正确性，而无法识别申诉人是否系真正账号权使用人。对用户因被他人冒名申诉而致的任何损失，六间房公司不承担任何责任。
</p>
<p>
2.9、欢朋账号或欢朋ID号码的所有权属于六间房公司。为了充分利用欢朋ID号码资源，若用户存在长期未登录使用欢朋号码的情形，六间房公司有权对该号码进行回收、替换等终止使用操作。
</p>
<p>
2.10、六间房公司有权根据运营需要，发布欢朋直播社区规则规范。用户在使用六间房公司服务或六间房公司产品的过程中，需遵守六间房公司发布的各项规定。
</p>
<p>
2.11、如用户违反法律法规、六间房公司或社区规则的规定，六间房公司有权根据相关规则进行违规判定，并采取相应限制或处罚措施，包括但不限于：限制或冻结用户对欢朋ID号码的使用，限制或停止某项单独服务，扣除保证金，扣减收入分成并根据实际情况决定是否恢复使用等。
</p>
<p>
2.12、六间房公司根据2.11条限制、冻结、回收、替换或终止用户欢朋ID号码的使用，可能会给用户造成一定的损失，该损失由用户自行承担，六间房公司不承担任何责任
<p>
<h5>
3、用户不得从事以下行为：
</h5>
<p>
3.1、利用六间房公司服务产品发表、传送、传播、储存危害国家安全、国家统一、社会稳定的内容，或侮辱诽谤、色情、暴力、引起他人不安及任何违反国家法律法规政策的内容或者设置含有上述内容的网名、角色名。
</p>
<p>
3.2、利用六间房公司服务发表、传送、传播、储存侵害他人知识产权、商业机密权、肖像权、隐私权等合法权利的内容。
</p>
<p>
3.3、进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/账户；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本“软件”系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏本“软件”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称。
</p>
<p>
3.4、进行任何破坏六间房公司服务公平性或者其他影响应用正常秩序的行为，如主动或被动刷分、合伙作弊、使用外挂或者其他的作弊软件、利用BUG（又叫“漏洞”或者“缺陷”）来获得不正当的非法利益，或者利用互联网或其他方式将外挂、作弊软件、BUG公之于众。
</p>
<p>
3.5、进行任何诸如发布广告、销售商品的商业行为，或者进行任何非法的侵害六间房公司利益的行为，如贩卖游戏币、外挂、道具等。
</p>
<p>
3.6、进行其他任何违法以及侵犯其他个人、公司、社会团体、组织的合法权益的行为。
</p>

<h5>4、六间房公司声明</h5>
<p>
4.1、欢朋直播网站上（www.huanpeng.com）可能存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，六间房公司对服务质量不作担保，不论是明确的或隐含的，包括所有有关信息真实性、适当性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。
</p>
<p>
4.2、使用六间房公司服务必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本条款，对于用户违法或违反本协议的使用(包括但不限于言论发表、传送等)而引起的一切责任，由用户负全部责任
</p>
<p>
4.3、用户理解并同意，六间房公司的服务同大多数互联网产品一样，易受到各种安全问题的困扰，包括但不限于：
</p>
<p style="text-indent: 8em;">
1）透露详细个人资料，被不法分子利用，造成现实生活中的骚扰；
</p>
<p style="text-indent: 8em;">
2）哄骗、破译密码；
</p>
<p style="text-indent: 8em;">
3）下载安装的其它软件中含有“特洛伊木马”等病毒，威胁到个人计算机上信息和数据的安全，继而威胁对本服务的使用。对于发生上述情况的，六间房公司不承担责任。
</p>
<p>
4.4、用户理解并同意，互联网技术的不稳定性，可能导致政府政策管制、病毒入侵、黑客攻击、服务器系统崩溃或者其他现今技术无法解决的风险发生可能导致六间房公司服务中断或账号道具损失，对此非人为因素引起的损失六间房公司不承担责任
</p>
<p>
4.5、用户须明白，六间房公司为了服务整体运营的需要，有权在公告通知后修改或中断、中止或终止服务而不需通知用户，并无须承担任何赔偿责任。
</p>
<p>
4.6、六间房公司不承诺本网站或本网站的任何内容、服务或功能无任何错误或不中断，不承诺任何瑕疵将被纠正，或者用户对本网站的使用将产生特定结果。本网站及其内容是基于“现状”且“可获得”而提供。本网站提供的所有信息可不经通知而变更。六间房公司不能确保您从本网站下载的任何资料或其他数据无病毒、无污染或不具破坏性。六间房公司不作任何明示或默示保证，包括任何正确性、非侵权、适销性及适用性的保证。对于任何及所有与您对本网站和/或任何六间房公司服务的使用有关的任何第三方的作为、不作为和行为，六间房公司概不承担责任。您对本网站及任何链接网站的使用，由您承担全部责任。如果对本网站或任何内容有任何不满意，您唯一的救济方式是停止使用本网站或任何该等内容。救济限制是双方协议的一部分。
</p>
<p>
上述免责声明适用于因任何不履行、错误、疏忽、中断、删除、缺陷、操作或传输迟延、电脑病毒、通信线路故障、失窃或破坏或未经授权访问、篡改或使用 (无论是违约、侵权、过失或任何其他诉因) 而造成的任何损害、责任或伤害。
</p>
<p>
六间房公司保留在任何时候不经通知进行以下任何行为的权利：(1) 基于任何原因，修改、中止或终止本网站或其任何部分的运行或访问；(2) 修改或变更本网站或其任何部分及任何适用政策或条款；以及 (3) 在进行定期或非定期维护、错误纠正或其他变更所必须时，中断本网站或其任何部分的运行。
</p>
<h5>5、知识产权</h5>
<p>
5.1、六间房公司运营的网站、网页应用、软件及其所有文字、图表、用户界面、可视界面、图片、商标、标识、声音、音乐、美术作品及计算机编码 (合称为“内容”），包括但不限于该等内容的设计、结构、选择、协调、表达、“界面外观”及排序等，均属六间房公司所有、受六间房公司控制或许可给六间房公司使用，且受商业外观法、著作权法、专利法、商标法以及各类其他知识产权法和反不正当竞争法的保护。
</p>
<p>
5.2、未经六间房公司事先明确书面同意，不得为出版或发行或为任何商业企业以任何方式 (包括“镜像”) 将本网站的任何部分及任何内容复制、再制、重印、上传、发布、公开展示、编码、翻译、传输或散布至任何其他计算机、服务器、网站或其他媒介。
</p>
<p>
5.3、用户不得通过非法侵入、“破解”密码或任何其他非法方式，未经授权访问本网站的任何部分或功能，或者链接至本网站的任何其他系统或网络，或者未经授权取得本网站提供的任何服务。用户使用六间房公司服务只能在本《用户协议》以及相应的授权许可协议授权的范围使用六间房公司知识产权，未经授权超范围使用的构成对六间房公司的侵权。
</p>
<p>
5.4、用户在使用六间房公司服务时发表上传的文字、图片、视频、软件以及表演等用户原创的信息，此部分信息的知识产权归用户，但用户的发表、上传行为是对六间房公司服务平台的授权，用户确认其发表、上传的信息非独占性、永久性地授权六间房公司使用，该授权可转授权。六间房公司可将前述信息在六间房公司旗下的服务平台上使用，可再次编辑后使用，也可以由六间房公司授权给其合作方使用。
</p>
<p>
5.5、若用户上传、存储、传播的信息有侵犯的用户或第三人的知识产权的，请根据公司《著作权声明》的有关内容进行申诉并寻求保护。
</p>
<h5>6、隐私保护</h5>
<p>
6.1、请用户注意勿在使用六间房公司服务中透露自己的各类财产帐户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，否则由此带来的任何损失由用户自行承担。
</p>
<p>
6.2、用户的账号、密码属于保密信息，用户应当负责保护器账号、密码的安全。
</p>
<p>
6.3、用户的注册信息将被视为六间房公司的商业秘密得到合理保护。但用户同时明白，由于互联网的开放性以及技术更新非常快，非六间房公司过错导致用户泄漏的，六间房公司不承担责任。
</p>
<p>
6.4、用户在使用六间房公司服务时不可将涉及其自身或他人隐私的信息发表、上传，也不可将该等信息通过六间房公司的服务传播给其他人，若用户的行为引起的隐私泄漏，由用户承担责任。
</p>
<p>
6.5、六间房公司在提供服务时可能会搜集用户信息，您在本网站提供的任何反馈均视为非保密。信息包括但不限于用户姓名、性别、年龄、出生日期、身份证号、家庭住址、教育程度、公司情况、所属行业、兴趣爱好等，用户同意提供六间房公司的收集行为，六间房公司可不受限制地使用该等信息。
</p>
<p>
6.6、就下列相关事宜的发生，六间房公司不承担任何法律责任：
</p>
<p style="text-indent: 8em">
1）六间房公司根据法律规定或相关政府、司法机关的要求提供您的个人信息；
</p>
<p style="text-indent: 8em">
2）由于用户将用户密码告知他人或与他人共享注册账户，由此导致的任何个人信息的泄漏，或其他非因六间房公司原因导致的个人信息的泄漏；
</p>
<p style="text-indent: 8em">
3）任何由于黑客攻击、电脑病毒侵入造成的信息泄漏；
</p>
<p style="text-indent: 8em">
4）因不可抗力导致的信息泄漏；
</p>
<h5>7、其他条款</h5>
<p>
7.1、本协议的签署地点为六间房公司服务器所在地即北京市海淀区，若用户与六间房公司发生争议的，双方同意将争议提交北京市海淀区法院诉讼解决。
</p>
<p>
7.2、本协议由六间房公司公布在网站上，对六间房公司具有法律约束力；用户一经点击接受或者直接登录的行为视为对本协议的接受，对用户具有法律约束力。
</p>
</div>
</div>
</div>
<?php include $path.'/../footerSub.php'; ?>
<script>var head = new head(null,false);</script>
</body>
</html>