<?php
/**
 * 主播协议
 * 
 *   */
?>
<!DOCTYPE html>
<html>
<head>
<title>主播服务协议-欢朋直播-精彩手游直播平台！</title>
<meta charset="UTF-8">
<?php include '../tpl/commSource.php';?>
<!--	<script type="application/javascript" src="../static/js/common.js"></script>-->
	<script type="application/javascript">
		window.pageTitle = document.title;
	</script>
</head>
<body>
<?php include $path = realpath(__DIR__); include $path . '/../head.php'; ?>
<style>
body{
	background:#eee;
}
.protocol-contain{
	width:980px;
	margin:100px auto 50px auto;
	color:#666; 
}
.protocol-body{
	background:#fff;
	padding:50px; 
}
.protocol-body .protocol-title{
	border-bottom: 1px solid #f4f4f4;
    font-family: "微软雅黑";
    padding-bottom: 22px;
}
.protocol-body .protocol-title h3{
	text-align: center;
    font-size: 22px;
    color: #444;
    line-height: 30px;
    font-weight: normal;
}
.protocol-body .protocol-content{
	margin-top: 28px;
    font-family: "微软雅黑";
}
.protocol-body .protocol-content p{
	line-height: 1.5em;
    font-size: 13px;
    padding: 0px 0px;
	text-indent:2em;
}
</style>
<div class="protocol-contain">
<div class="protocol-body">
<div class="protocol-title"><h3>主播－直播服务协议</h3></div>
<div class="protocol-content">

<h5>一、总则</h5>
<p>
在签署本协议之前，六间房公司正式提醒用户：
</p>
<p>
1.1 北京六间房科技有限公司（以下简称“六间房公司”或“六间房”），在国家法律法规、六间房公司的各种规定、规则、管理办法等所有制度范围内，提供基于互联网以及移动网的相关视频互动直播技术支持服务（以下称“视频直播服务”）。
</p>
<p>
1.2 为获得视频直播服务，服务使用人（以下称“用户”）已审慎和仔细阅读本协议，清楚理解本协议的全部条款和含义，包括免除或者限制六间房公司责任的免责条款以及对用户的权利限制条款，并且完全接受及本协议项下的全部条款。除非用户已阅读并接受本协议所有条款，否则用户无法在六间房公司提供的游戏视频直播服务平台---欢朋网站上注册为直播主播（以下简称“主播”）。用户在注册欢朋游戏视频直播服务平台账号时，勾选“我同意以上条款”勾选框并按下“提交申请”即表示用户完全接受本协议项下的全部条款。用户使用六间房/欢朋的视频直播服务视为用户完全同意本协议的条款并自愿接受本协议的约束。
</p>
<p>
1.3 主播账号和密码由主播负责保管，主播应当对以其主播账号进行的所有活动、事件、结果负法律责任。
</p>
<p>
1.4 用户申请注册成功后，即可在欢朋平台进行游戏视频直播活动。
</p>
<p>
1.5 欢朋平台包括移动互联网客户端（目前支持Android系统、IOS系统）及互联网PC端网站（相关网站www.huanpeng.com ）
</p>

<p>
1.6 六间房公司对本协议以及六间房的各种规定、规则、管理办法等所有制度享有解释权并有权根据国家各项法律法规、政策等随时进行调整，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在欢朋网站查阅最新版协议条款。本协议以及六间房的各种规定、规则、管理办法等构成用户（无论个人或者单位）使用六间房公司所提供的服务及其衍生服务之先决条件，通过访问和/或使用六间房提供的网站、客户端及其他服务；如果用户不愿意接受全部条款，用户应不使用或主动取消六间房提供的任何服务，否则视为已接受全部条款。本协议适用于六间房提供的，并需要用户注册的全部网页服务、客户端服务、及其他服务。
</p>
<p>
1.7申请注册成为主播的用户须年满18周岁。因国家法律法规禁止未满18周岁的未成年人使用本协议项下的视频直播服务，未满年龄的用户应自觉遵守规定，否则因此导致的一切损失均由用户自行承担。
</p>

<h5>
二、视频直播服务内容
</h5>
<p>
2.1 欢朋游戏视频直播服务的具体内容由六间房公司根据现有技术和实际情况提供。</p>
<p>
2.2 鉴于视频直播的特殊性，六间房公司根据按国家相关法律法规及相关运营规则提供视频直播服务。</p>


<h5>三、视频直播服务规则</h5>
<p>
3.1 鉴于视频直播服务的特殊性，主播同意六间房公司有权随时变更、中断或终止部分或全部的视频直播服务。如变更、中断或终止视频直播服务而造成任何损失，六间房公司无需对主播或任何第三方承担任何责任，六间房公司尽量在变更、中断或终止服务之前事先通知主播（通知方式由六间房公司根据具体情况确定）。</p>
<p>
3.2 由于六间房需要定期或不定期地对提供视频直播服务的平台（如互联网网站、移动网络等）或相关的设备进行检修和维护，如因此类情况而造成视频直播服务在合理时间内的中断的，六间房无需为此承担任何责任，但六间房公司将尽量减小因此给主播造成的影响。</p>
<p>
3.3 如发生下列任何一种情形，六间房公司/欢朋平台有权随时暂停或取消用户的主播资格并且有权随时中断或终止向用户提供本协议项下的视频直播服务而无需对主播或任何第三方承担任何责任：</p>
<p style="text-indent: 8em;">
3.3.1 主播提供的个人资料不真实；
</p>
<p style="text-indent: 8em;">
3.3.2 主播违反本协议的约定或违反六间房的运营规则；
</p>
<p style="text-indent: 8em;">
3.3.3 主播违反我国法律、法规及规章的。
</p>
<p>
3.4用户在使用视频直播服务过程中有任何不当行为，或违反法律法规和六间房公司的相关运营规则，或侵犯第三方合法权益，都由用户自行承担相应责任，六间房公司/欢朋无需要承担任何责任。如因用户的行为而给六间房/欢朋平台造成损害的，用户应予赔偿。</p>
<p>
3.5用户在使用视频直播服务过程中，遵守国家相关法律法规和本协议的约定，同意接受和遵守六间房公司发布的全部管理规定及其它相关运营规则（具体运营规则以六间房发布的最新内容为准）。如违反本条约定，用户同意并接受六间房根据约定或规则对其采取暂停直播服务等其它处罚措施。
</p>
<h5>四、签约主播权利与义务</h5>
<p>
4.1主播通过六间房公司/欢朋上传、发布个人照片、音乐、语音音频、个人视频或将前述信息提供给六间房公司/欢朋，即表示主播对前述信息拥有合法权利且就前述音乐、影视、图片的相关权利（包含但不限于表演者权、录音制作者权、词曲著作权、影视版权、节目版权、肖像权）授权给六间房公司/欢朋一项不可撤销的独家的永久免费许可，使用形式包括但不限于音像制品、杂志封面、网上传播、图书报刊出版、展览、广告宣传、将原始作品根据商业用途进行改动、加工或整合等，使用用途包括非商业和商业两类，该授权没有地域限制。
</p>
<p>
4.2主播在视频直播过程中使用歌曲、背景音乐、录音录像制品及其他涉及知识产权、肖像权等第三方权利的内容或将音视频、图片等涉及知识产权、肖像权等第三方权利的内容发布在欢朋平台的，即视为主播已经获得相应授权或本人即为知识产权所有者且前述内容无任何权利瑕疵。否则，六间房公司/欢朋有权直接删除可能侵权或已经侵权的内容，并对主播进行相应处理。因直接删除造成的不利后果及侵权或可能侵权带来的一切责任由主播自行承担，与六间房公司/欢朋无关。六间房公司/欢朋因此遭受损失的，有权要求主播赔偿。
</p>
<p>
4.3 主播保证遵守国家有关法律、行政法规和管理规章，严格执行《信息网络传播权保护条例》等相关规定。
</p>
<p>4.4主播不得利用六间房公司提供的视频直播服务从事危害国家安全、泄露国家机密等违法犯罪活动，不得利用六间房公司提供的视频直播服务传播违反宪法和法律、妨害社会治安、破坏国家统一、破坏民族团结、色情、暴力等的信息。
4.5签约主播不得在欢朋平台直播以下内容：
</p>
<p>4.5.1 严禁进行反党反政府或带有侮辱诋毁党和国家的行为，例如：</p>
<p style="text-indent: 8em;">
（1）违反宪法确定的基本原则的；
</p>
<p style="text-indent: 8em;">
（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
</p>
<p style="text-indent: 8em;">
（3）损害国家荣誉和利益的；
</p>
<p style="text-indent: 8em;">
（4）煽动民族仇恨、民族歧视、破坏民族团结的；
</p>
<p style="text-indent: 8em;">
（5）破坏国家宗教政策，宣扬邪教和封建迷信的；
</p>
<p style="text-indent: 8em;">
（6）散布谣言，扰乱社会秩序，破坏社会稳定的；
</p>
<p style="text-indent: 8em;">
（7）散布暴力、恐怖或者教唆犯罪的；
</p>
<p style="text-indent: 8em;">
（8）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
</p>
<p style="text-indent: 8em;">
（9）其他可能引起或已经引起不良影响的政治话题。
</p>

<p>
4.5.2严禁直播违反国家法律法规的内容，例如：
</p>
<p style="text-indent: 8em;">
（1）展示毒品样品、表演及传播毒品吸食或注射方式、讲解毒品制作过程等一切与毒品相关的内容；
</p>
<p style="text-indent: 8em;">
（2）组织、宣传、诱导用户加入传销（或有传销嫌疑）的机构；
</p>
<p style="text-indent: 8em;">
（3）与赌博或涉嫌赌博有关的任何活动。
</p>
<p style="text-indent: 8em;">
（4）播放自己或他人的腐朽、低级趣味活动，如享受不道德的、腐朽的消费等；
</p>
<p style="text-indent: 8em;">
（5）其它低俗涉黄行为。
</p>
<p>4.5.3严禁进行威胁生命健康，或利用枪支、刀具表演，例如：</p>
<p style="text-indent: 8em;">
（1）使用刀具、仿真刀具、枪支、仿真枪支、表演具有高度危险性的节目等；
</p>
<p style="text-indent: 8em;">
（2）表演危害他人人身安全的内容。如：殴打他人、威胁他人等；
</p>
<p style="text-indent: 8em;">
（3）表演危害自身安全的内容。如自残自杀等；
</p>
<p style="text-indent: 8em;">
（4）表演危害动物生命健康的内容。如虐待小动物等；
</p>
<p style="text-indent: 8em;">
（5）其他威胁生命健康的表演。
</p>
<p>4.5.4严禁侵犯他人合法权益，例如：</p>
<p style="text-indent: 8em;">
（1）侵犯他人隐私，危及公众利益，未经当事人同意，禁止公开他人姓名、住址、电话等个人资料、进行任何形式的采访、与公众进行互动及其他隐私信息；
</p>
<p style="text-indent: 8em;">
（2）使用文字、语音、图片等任何形式宣传其他同类型语音、视频平台；
</p>
<p style="text-indent: 8em;">
（3）播放未经授权的影视、音乐作品，侵犯第三方的合法知识产权；
</p>
<p style="text-indent: 8em;">
（4）进行其他侵害他人合法权益的行为。
</p>
<p style="text-indent: 8em;">
（5）冒充媒体、电视台、记者等名义进行直播活动；
</p>
<p style="text-indent: 8em;">
（6）发布广告信息：包括所有违反国家法律及六间房公司相关管理规则的信息。如：赌博类、博彩类、刷QB、YB等、成人用品类、枪支、军刀、弓弩类、成人影视类、云盘类广告、性用品、保健品类、香烟广告、非法性药品广告和性病治疗广告等相关内容。
</p>

<p>4.5.5严禁以任何形式表演带有色情、涉黄擦边、引起他人性欲、低级趣味的内容，例如：</p>
<p style="text-indent: 8em;">
（1）通过各种方式展示或隐晦展示具有性特征的身体敏感部位，例如：
</p>
<p style="text-indent: 12em;">
a.将镜头刻意聚焦性敏感部位；
</p>
<p style="text-indent: 12em;">
b.进行带有性暗示的抚摸、拉扯等动作；
</p>
<p style="text-indent: 12em;">
c.使用性用品（或容易联想到性用品的其他物品）作为表演道具；
</p>
<p style="text-indent: 12em;">
d.其他性暗示行为。
</p>
<p style="text-indent: 8em;">
（2）传播具有性行为、性挑逗或性侮辱内容的任何信息；
</p>
<p style="text-indent: 12em;">
a.传播侵犯他人隐私的走光、偷拍、漏点等信息；
</p>
<p style="text-indent: 12em;">
b.传播招嫖、一夜情、换妻、性虐待等的有害信息；
</p>
<p style="text-indent: 12em;">
c.传播情色游戏、动漫；
</p>
<p style="text-indent: 12em;">
d.传播淫秽、低俗网站；
</p>
<p style="text-indent: 12em;">
e.传播涉黄、带有性挑逗的图片、言论、歌曲、文字、视频、声音等内容。
</p>
<p>
4.5.6其他规范要求：
</p>
<p style="text-indent: 8em;">
（1）在进行视频表演时抽烟、酗酒；
</p>
<p style="text-indent: 8em;">
（2）主播视频直播时连续爆粗口或持续谩骂、侮辱或者诽谤他人，侵害他人合法权益的；
</p>
<p style="text-indent: 8em;">
（3）主播使用国家领导人名为昵称拿国家领导人恶作剧，讨论与政治有关的言论、损害国家荣誉和利益的；
</p>
<p style="text-indent: 8em;">
（4） 主播在房间进行色情、暴力、反动、鼓动、扰乱社会治安等方面的表演；
</p>
<p style="text-indent: 8em;">
（6）主播在直播时煽动民族仇恨、民族歧视，破坏民族团结的；
</p>
<p style="text-indent: 8em;">
（7）主播在直播时破坏国家宗教政策，宣扬邪教和封建迷信的；
</p>
<p style="text-indent: 8em;">
（8）主播演唱带有黄色、擦边、政治等违禁信息歌曲；
</p>
<p style="text-indent: 8em;">
（9）组织赌博，展示吸毒、自残、恐怖或教唆犯罪等违法或不良行为；
</p>
<p style="text-indent: 8em;">
（10）穿着过于裸露的服装进行表演包括但不限于以下服装：内衣、泳装、透视装、肉色紧身衣、爆乳装；
</p>
<p style="text-indent: 8em;">
（11）通过模仿色情动作或进行自我抚摸、并企图暴露敏感部位等引起性挑逗的行为；
</p>
<p style="text-indent: 8em;">
（12）表演脱衣舞等具有挑逗性的表现形式；
</p>
<p style="text-indent: 8em;">
（13） 含有法律、行政法规严令禁止的其他内容和行为。
</p>

<p>
4.5.7 主播不得利用六间房公司网络服务系统进行任何不利于六间房公司/欢朋平台的行为；
</p>
<p>
4.5.8主播不得在欢朋直播间挂录像、直播内容同时传送外站。
</p>
<p>
4.5.9主播不得利用六间房公司网络服务以任何理由或方式拉拢欢朋平台其他主播或其他用户去其他同类竞争网站或停止在欢朋平台提供服务、消费。
</p>
<p>
4.5.10主播不得将六间房公司/欢朋平台的商业和技术秘密泄露给任何第三方。
</p>
<p>
4.5.11 用户申请主播资格时，必须向六间房公司提供合法有效且准确的个人资料（包括但不限于身份证号、银行帐号、联系方式、居住地址等），经六间房公司审核通过后方可开通视频直播服务。如提供资料不实，六间房公司有权不予通过主播申请或随时取消主播资格；如主播个人资料有任何变动，必须及时更新并通知六间房公司进行审核。如因主播提供的个人资料等不实而造成任何损失，由签主播自己承担全部责任和损失。
</p>
<p>
4.5.12 主播不得将其账号、密码转让或出借给他人使用。如因黑客行为或用户的保管疏忽导致账号、密码遭他人非法盗取、使用或遭受损失，六间房公司/欢朋平台不承担任何责任；如给六间房公司/欢朋平台造成损害的，则主播应予赔偿。
</p>
<p>
4.6 若主播违反运营规则及本协议项下的规定，主播自行承担违规后相应的法律责任。六间房公司/欢朋平台不对此或任何第三方承担任何连带的法律责任或者义务。
</p>
<p>
4.7 如主播不再就4.1、4.2的内容享有相应权利（即无权使用相应作品或无权将相应作品提供到欢朋平台）的，主播应自行停止传播该内容或第一时间通知六间房公司/欢朋平台工作人员进行删除，如因主播未及时通知导致六间房公司/欢朋平台遭受第三方的投诉或者诉讼等，因此导致的一切损失均由主播承担，如六间房公司代为解决并承担的，六间房公司有权向主播追偿。
</p>
<p>
4.8 若主播违反运营规则及本协议项下的规定，六间房公司有权采取措施，对违规主播及违规主播的侵权行为进行相应处理，情节严重者可直接将其下线、永久封号、永久剥夺申请六间房公司主播的资格；并配合相关业务主管部门追究其法律责任和经济责任。
</p>
<h5>五、双方关系</h5>
<p>
5.1 六间房公司仅为主播提供视频直播服务平台，主播与六间房公司/欢朋平台不存在任何劳动或者雇佣关系，主播也不得以任何形式被认定为是六间房公司/欢朋平台的员工。六间房公司仅为平台服务提供者，不对主播承担任何法律责任。
</p>
<h5>六、运营规则和协议的修改</h5>
<p>
6.1 六间房公司有权修改相关运营规则和本协议的条款，一旦运营规则或本协议的内容有修改和变动，六间房公司将会直接在网站页面公布修改之后的运营规则，新的运营规则或协议自公布之日或通知之日即时生效。公布行为视为六间房公司已经通知主播修改内容，六间房公司也可通过其他适当方式向主播提示修改内容，主播也可自行到六间房公司/欢朋平台相关网站查阅。
</p>
<p>
6.2 如果主播不同意六间房公司新的运营规则或对本协议内容所做的修改，主播有权申请取消主播资格。如果用户继续使用主播账号及视频直播服务，则视为用户同意并接受六间房公司新的运营规则和六间房公司对本协议相关条款所做的修改。
</p>
<h5>七、免责声明</h5>
<p>
7.1 主播完全根据自身意志和意愿以自身行为进行视频直播，同意使用六间房公司视频直播服务所存在的风险完全由其自己承担；因主播进行视频直播而产生的一切损害、损失、责任及后果也由其自己承担，六间房公司对主播不承担任何责任。
</p>
<p>
7.2 六间房公司根据现有技术条件和实际情况尽量提供符合要求的视频直播服务，但并不担保视频直播服务一定能满足主播的全部要求，也不担保视频直播服务因实际情况出现变更、中断或终止的情形；六间房公司对视频直播服务的及时性、安全性、准确性也不作担保。
</p>
<p>
7.3 对于因不可抗力或六间房公司不能控制的原因造成的视频直播服务中断或其它缺陷，六间房公司不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
</p>

<p>
7.4 用户如无法接受本协议相关约定和免责声明，有权自主决定不申请成为主播或申请取消主播资格。如接受本协议，应严格遵守相关条款。用户使用视频直播服务视为用户接受协议并受协议、运营规则约束。
</p>
<h5>八、其他约定</h5>
<p>8.1 如主播和六间房公司/欢朋平台之间就协议的签订、履行等产生任何纠纷，双方应友好协商；如协商不成，则应提交北京市海淀区人民法院管辖。</p>
<p>8.2本协议自用户勾选“我同意以上条款”勾选框并按下“提交申请”起生效。</p>
<p>8.3本协议名称及所有条款标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
</div>   
</div>
</div>
<?php include $path . '/../footerSub.php'; ?>
<script>var head = new head(null,false);</script>
</body>
</html>