<template>
  <div class="iframe">
  	<v-header>
  	  <a slot="main-nav" class="go-backbtn" @click="goBack"></a>
  	  <p slot="title" class="title">欢朋充值服务协议</p>
  	</v-header>
  	<!-- <iframe :src="iframeSrc" frameborder="0"></iframe> -->
  	<div class="container">
		<p>六间房公司按照本协议的规定及其不时发布的操作规则提供基于互联网的充值服务(以下称“充值服务”)，为获得充值服务，服务使用人(以下称“用户”)同意本协议的全部条款并按照页面上的提示完成全部的充值程序。用户在进行充值程序过程中点击“同意”按钮即表示用户完全接受本协议项下的全部条款。用户在使用六间房公司提供的各项服务之前，应仔细阅读本服务协议，如用户不同意本充值用户协议及或随时对其的修改，请停止使用六间房公司提供的服务。</p>
		<br>
		<p>特别提示：未成年用户使用六间房公司充值服务，必须得到家长或其他监护人的同意。六间房公司对于未成年用户使用本服务过程中的行为，以及因其使用本服务而产生的一切后果不承担任何责任。</p>
		<br>
		<h3>1、关于欢朋币</h3>
		<p>欢朋币是六间房公司为用户提供的用于欢朋直播平台相关消费的虚拟货币，也是六间房公司充值平台的中间货币，可以自由转换成欢朋平台下各产品的消费货币。欢朋币不能兑换成人民币。</p>
		<h3>2、服务内容</h3>
		<p>六间房公司的充值系统提供支付宝、微信等不同的充值方式，用户可通过前述方式为欢朋账号充值</p>
		<h3>3、操作方法</h3>
		<p>3.1 用户可自由选择具体的充值方式，并按相应页面提示的程序完成充值。</p>
		<p>3.2 使用六间房公司充值方式充值游戏成功后有5分钟的调整时间，用户请在充值成功的5分钟后再尝试查看账户余额。</p>
		<p>3.3 用户充值后，应保留充值订单号以作为核对依据。</p>
		<h3>4、风险提示</h3>
		<p>4.1 充值时，用户应确认充值帐号并选择相关选项。若因帐号输入错误、操作不当或不了解充值计费方式等因素造成充错、错选充值种类等情形而损害自身权益的，由用户自行承担损失。</p>
		<p>4.2 若用户以非法的方式，或使用非六间房公司所指定的充值方式进行充值，六间房公司不保证该充值顺利或者正确完成。若因此造成用户权益受损时，由用户自行承担损失，且六间房公司保留冻结、终止该用户欢朋账号及使用各项充值服务的权利。</p>
		<h3>5、充值成功后</h3>
		<p>充值成功后，账号内欢朋币可由用户自由使用，但六间房公司不会提供任何退还或逆向兑换服务。</p>
		<h3>6、渠道商服务手续费用</h3>
		<p>各充值方式对应的渠道商可能会按其标准制定相关充值渠道手续费用（六间房将在充值操作页面上进行提示），并在用户充值时收取。六间房公司特此提醒：请用户务必注意各充值方式的渠道商服务手续费，并按自己的需求选取充值方式。</p>
		<h3>7、若因六间房公司原因导致用户充值失实并经查证属实的，六间房公司将根据用户实际充值情况采取以下措施：</h3>
		<p>7.1造成系统充值额小于用户实际充值额的，六间房公司予以补其差额；</p>
		<p>7.2造成系统充值额大于用户实际充值额的，六间房公司有权追回差额；</p>
		<h3>8、服务变更、中断或终止</h3>
		<p>8.1 六间房公司可以根据业务需求随时变更服务或更新本协议的条款，但应在相关的页面上及时提示修改内容。修改后的服务协议一旦在页面上公布即代替原来的服务协议。</p>
		<p>8.2 如发生下列任何一种情形，六间房公司有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：<br>
			(a) 用户提供的个人资料不真实；<br>
			(b) 用户违反本协议中规定的使用规则。
		</p>
		<h3>9. 免责声明和损害赔偿</h3>
		<p>9.1发生下列情况时，六间房公司免于承担任何法律责任：</p>
		<p>（a）用户因使用第三方支付渠道充值过程中发生的相关争议；</p>
		<p>（b）由于用户将密码告知他人导致的用户财产损失；</p>
		<p>（c）因用户个人故意或重大过失或本协议之外的第三方所造成的用户财产损失；</p>
		<p>（d）由不可抗力及不可预见的情势导致的各种情况和纠纷；不可抗力和不可预见情势包括：黑客攻击、电信部门技术调整导致重大影响、政府管制导致的暂时关闭、病毒侵袭。</p>
		<p>9.2 用户同意保障和维护六间房公司及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给六间房公司或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</p>
		
		<h3>10. 其他</h3>

		<p>10.1 本协议的订立、执行和解释及争议的解决均应适用中国法律。</p>
		<p>10.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均应向北京市海淀区人民法院提起诉讼。</p>
		<p>10.3 本协议项所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</p>

	</div>
  </div>
</template>

<script>
  import vHeader from 'components/header/header';
  export default {
  	name: 'iframe',
  	components: {vHeader},
  	created() {
  	  // this.iframeSrc = this.$route.query.url;
  	},
  	methods: {
  	  goBack() {
  	  	this.$router.go(-1);
  	  }
  	}
  }
</script>

<style lang="less">
 @import '~assets/css/common';
 .go-backbtn {
	width: 56/@myrem;
	height: 56/@myrem;
	position: absolute;
	left: 32/@myrem;
	top: 16/@myrem;
	background: url(../../assets/image/icon_back.png) no-repeat;
	background-size: 56/@myrem;
  }
 iframe {
    position: absolute;
    top:88/75rem;
    left:0;
    bottom: 0;
    right: 0;
	width: 100%;
 }
 .iframe {
 	.container {
 	  background: #fff;
 	  padding: 108/@myrem 20/@myrem;
 	  font-family: inherit;
 	  line-height: 38/@myrem;
 	  p {
 	  	font-size: 28/@myrem;
 	  	text-indent: 2em;
 	  	margin-bottom: 20/@myrem;
 	  }
 	  h3 {
 	  	color: @hpColor;
 	  	font-size: 28/@myrem;
 	  	margin-bottom: 10/@myrem;
 	  }
 	}
 }
</style>